{"data":{"contentfulAbout":{"pageTitle":"About Lyn","heroImage":{"file":{"url":"//images.ctfassets.net/buawi7gya7qk/3TzW4dKJDpnhHzG6IsqDWK/0fb642424b16fb9b27e184540cee3513/DSC_5824.jpg"}},"mainContent":{"childContentfulRichText":{"html":"<p>Because my own family legacy required me to project an image of the perfect Mormon family, I’ve always been fascinated by the stark divide between the perceptions of a family to the outside world and the inside reality of that world.  Also, what price we pay for secrets and their ongoing cost to the individual and family, the interplay of identity, loyalty, religious identification, and characteristics of survivorship. I’ve explored these themes in <i>We Were Smiths:</i> <i>A Memoir</i>. </p><p>I earned an MBA from New York University and then spent almost 20 years in the corporate business world before a personal crises returned me to earlier passions, writing and psychology, my undergraduate degrees.   I began writing again, spurred by the suddenly pressing questions I had that I hoped would be answered in the hundreds of journals my sister and I kept growing up. I set out to explore how we both perceived our lives, comparing and contrasting our experiences of leaving the Mormon faith, and our very different outcomes.  This was the impetus for<i> We Were Smiths: A Memoir</i>.</p><p>After taking several local writing classes, I joined a small Writing Group that met bi-monthly for formal critique and feedback discussion.  This step was critical in developing my memories into the structure of story,  and editing the slowly building memoir taking shape. Feedback from the Iowa Memoir Writing Program (one of 10 writers accepted) further influenced my direction and writing tone and I spent the next year editing, re-writing and condensing <i>We Were Smiths:</i> <i>A Memoir.</i>  </p><p>Feeling finished with the manuscript, I obtained an agent, and prepared a proposal for publishers of my memoir, ready to send it out.  But after some key feedback from several people close to me, I concluded that the story I was telling didn’t go deep enough, reveal enough, and I’m revising We Were Smiths: <i>A Memoir</i> one final time. </p><p>Having lived in Manhattan, Minneapolis and Atlanta, I now call the beautiful city of Savannah home. I live in the historical section, across from a green square, with my husband, Kent, and our over-indulged Maltepoo, Callie.  Our three terrific children, Elizabeth, Kyle and Kendall are grown and gone but, luckily for us, visit often.</p><p>\n        \n        \n          \n        \n      \n\n    \n\n  \n\n  \n    \n            \n          \n\n        \n      \n\n      \n\n  \n\n    </p>"}}}},"pageContext":{}}