{"data":{"contentfulHome":{"titleBlock":"We Were Smiths: A Memoir","mainContentBlock":{"childContentfulRichText":{"html":"<p></p><p>In my memoir, <i>We Were Smiths: A Memoir</i>, I reveal the consequences of leaving the Mormon Church as a descendant of Joseph Smith, the Mormon Church founder and prophet.  Why did my sister and I feel compelled to leave when so much was at stake? My family was considered Mormon royalty, but it was vulnerable to teenage rebellion, divorce, and substance abuse buried under the surface of our family’s perfect veneer.   </p><p><i>We Were Smiths</i>:<i> A Memoir</i> chronicles the divergent paths my sister and I took in abandoning the Mormon Church; me to Manhattan, and my sister to California. While close allies in our family of eleven, we rebelled in completely separate ways but remained close despite our contrasting lifestyles. My sister’s path took her from singing for drinks in Blues dives in San Francisco, to looking for love in the violent Hell’s Angels Long Beach posse.  Meanwhile, I was breaking the “boys only rule “ by launching the new Personal Computer with IBM but spending my nights caught in the spell of Studio 54’s coated cocaine scene.  We both gain our freedom from the Church but at very different costs. </p><p>Literary agent, Don Fehr, Senior Vice President at Trident Media in NYC, represents me.  I hope to finish my revisions and complete We Were Smiths: <i>A Memoir</i> sometime in 2019.\n</p><p>\n</p>"}},"photoCaption":" ","mainImage":{"fluid":{"aspectRatio":0.6675567423230975,"src":"//images.ctfassets.net/buawi7gya7qk/3TzW4dKJDpnhHzG6IsqDWK/0fb642424b16fb9b27e184540cee3513/DSC_5824.jpg?w=400&q=50","srcSet":"//images.ctfassets.net/buawi7gya7qk/3TzW4dKJDpnhHzG6IsqDWK/0fb642424b16fb9b27e184540cee3513/DSC_5824.jpg?w=100&h=150&q=50 100w,\n//images.ctfassets.net/buawi7gya7qk/3TzW4dKJDpnhHzG6IsqDWK/0fb642424b16fb9b27e184540cee3513/DSC_5824.jpg?w=200&h=300&q=50 200w,\n//images.ctfassets.net/buawi7gya7qk/3TzW4dKJDpnhHzG6IsqDWK/0fb642424b16fb9b27e184540cee3513/DSC_5824.jpg?w=400&h=599&q=50 400w,\n//images.ctfassets.net/buawi7gya7qk/3TzW4dKJDpnhHzG6IsqDWK/0fb642424b16fb9b27e184540cee3513/DSC_5824.jpg?w=500&h=749&q=50 500w","sizes":"(max-width: 400px) 100vw, 400px"}}}},"pageContext":{}}