{"data":{"contentfulMemoir":{"heroImage":{"file":{"url":"//images.ctfassets.net/buawi7gya7qk/7KoJHWOXZoS2TBCJGbpfRY/c4e636b457fbcd223f0bf864ccf89bfe/lyns_fixed.jpg"}},"heroText":{"childContentfulRichText":{"html":"<h2></h2><h2>We Were Smiths: A Memoir</h2><p></p>"}},"mainContent":{"childContentfulRichText":{"html":"<p></p><blockquote><p><i>We Were Smiths</i>: <i>A Memoir</i> is a unique, insider account of growing up as royalty in the Mormon Church, where lineage and family birthright define one’s status and importance. My great-great-grandfather was one of the few descendants of Joseph Smith to come west as a young orphan with Brigham Young, making my family a rarity in Utah who can claim a connection to the Church’s original founder and prophet.</p><p><i>We Were Smiths</i>: <i>A Memoir</i> will appeal to readers who enjoy pulling back the covers to see the dramatic  truth inside of a family collapsing under the weight of this unique Mormon legacy and how they implode and disperse, both physically and emotionally, from each other in the wake of an explosive family secret. </p><p>This first-person account details how two sisters break away from Church and family, in wildly different ways, fleeing Utah and everything they’ve known to chase their dreams.   Taking place  in Utah, California, and Manhattan,  I recreate, from my sister’s and my own extensive journals, a vivid picture of their vastly different and, sometimes similar, struggles to survive outside the Mormon faith and culture.</p><p>I divulge the family’s hidden flaws and secrets—alcoholism, bulimia, sexual abuse and suicide—assessing their impact on the family’s eventual dissolution. I also offer an insider’s perspective on how Mormon belief systems contributed to this fragmentation, to create the split between faithful Mormons and shunned Apostates and their struggle to somehow remain Smiths, a clan with fierce loyalties and love for each other.  I try to answer the question: Is it possible to transcend religious barriers and belief systems and retain a sense of family identity and belonging?  </p><p>At its heart, this is also a story of truth transforming a family as they explore the limits and exceptions of forgiveness, relinquishing old definitions of family, even God, in the attempt to reconcile as a family under a new, more generous and tolerant umbrella called the Smith family.  </p><p><i>We Were Smiths</i>: <i>A Memoir</i> mines the emotionally rich territory of memoirs such as Educated by Tara Westover, Leaving the Saints by Martha Beck and Jon Krakauer’s Under the Banner of Heaven, exploring the pitfalls of legacy, religion, identity, and the costs of freedom.</p></blockquote><p></p>"}}}},"pageContext":{}}