{"data":{"contentfulExcerpt":{"mainExcerpt":[{"pageNumber":" ","mainPageContent":{"childContentfulRichText":{"html":"<h3>                                                    Chapter Five</h3><p>When my father came home from work in the evenings, he emptied his pockets of change and tossed the coins into a copper bowl that he kept on his bedroom dresser.  In my pre-school days, when counting was new to me and therefore endlessly fascinating, my mother would sometimes put me on her bed in the afternoons with the copper bowl while she folded laundry on another part of the bed.  I’d sit cross-legged in my ankle socks and make separate stacks of coins—pennies, nickels, dimes and quarters—and count them, rearrange them, attempt to spin them on the too-soft surface of my parents’ sage green bedspread.  Afterwards, I would carefully return the coins to the bowl, and my mother would return the bowl to the dresser, beyond my reach.  It never would have occurred to me then to take a coin.\nBut now I needed a coin.  No, I needed two—a dime for the streetcar to take me where I was going, and another to bring me back. I was eleven years old.  I took the dimes, slipped them into the back pocket of my madras shorts with the newspaper advertisement I had torn that morning from the Sunday Times Picayune, and told my mother I was going down the block to play with my neighbor.\nI had never ridden the streetcar alone, but our maid, Anna Mae, had taken me on the streetcar to go shopping for school shoes on Oak Street, so I knew what to do.  I walked along the tracks in the middle of the neutral ground that divided St. Charles Avenue, and stopped next to the tall yellow post to wait.  There were few cars on the street that Sunday afternoon, and it took the streetcar a long time to come.  A last, I saw a streetcar roaring towards me from way down the track, framed by the canopy of giant oak trees lining the avenue.  The streetcar squealed to a stop, the doors opened and the stairs descended with a deep sigh. I grabbed the silver pole and climbed inside.  When I handed the conductor my dime, he raised his eyebrows and hesitated before taking it.  But then he shrugged and his hand closed around the coin.\n“I want to go to the Gallery Circle Theater in the French Quarter,” I told him.\n“Last stop is Canal Street,” he said.  “If you’re going to the Quarter, you’ll have to walk from there.”\nThe streetcar rocked and swayed.  I stumbled down the aisle and chose an empty wooden seat near an open window. Leaning my arm on the windowsill, then my cheek on my arm, I watched the tracks rush by below, then raised my eyes to the blur of porches and balconies, gardens and ornate iron gates.  The wind tangled my hair and stung my eyes.  It occurred to me I should have brought a comb.\nI crossed Canal Street inside a crowd and entered the French Quarter.  The crowd dispersed, people falling off at a block here, a block there, and then I was by myself, walking down Royal Street with its rows of narrow stores, their names gilt-lettered on the plate-glass windows.  I stopped in front of Manheim’s, the antique store where my Grandma Rose worked for more than forty years, and where my father sometimes dropped me off on Saturday mornings while he went to his office for a few hours.  The shop was closed now, and all I could see were the brocade sofas and upholstered chairs displayed in the window, with a shadowy darkness behind it, but I knew what loomed in that dark—a tight jumble of ornate furniture, tall polished wood counters, a terrifying open elevator with rope pulleys that would take us to the second floor.  I pressed my face to the glass, put my hands on either side to block out the light, and sought out among the dim shapes on curio shelves the mechanical monkey with his tiny drum and sticks, who delighted me with his antics when I turned the long, narrow key in the slot cut into the back of his red felt jacket.  He was hiding from me, I told myself at last, and continued on my way.\nAlong the way, I showed my crumpled newspaper article to people on the street—a hot dog vendor, then an Asian man not much bigger than I was, carrying a stack of white linens, then a very large woman in high heels, short-shorts, and a halter top, who frightened and confused me with the deep voice of a man.  And in this way, I arrived at the theater.\nI stood on Madison Street, a one-block street deep into the labyrinth Quarter.  When I glanced in one direction, I saw a wide avenue and then the green awning of Café Du Monde, where my Uncle Manny took me with his girlfriends for café au lait and beignets.  In the other direction, a man was walking crookedly away from me, a brown paper bag in one hand.\nBefore me was an arched wooden door, slightly ajar.  I pushed it open, and entered a sunny courtyard filled with pots of plants, round iron tables and chairs, a stone fountain.  There was no one in the courtyard.  I continued on, and came upon another wooden door, this one closed.  The door was so heavy that I had to push my body against it to open it.  Inside, after the day’s bright light, at first I could hardly see. Then images became clear, and I saw a stage, tiers of theater seats on three sides, a midnight blue velvet curtain along the back wall.  There were people everywhere, speaking in whispers, but there were so many of them that there seemed to be a swarming buzz surrounding me and carrying me into the room.  \nThere were women of all ages and sizes, but what stood out for me were all the little girls—maybe a dozen of them, maybe more, all wearing party dresses, some of lace, some with satin sashes.  Their hair was brushed and adorned with bows, their shoes were black or white Mary Janes, they wore white socks with frilly cuffs.  Each one seemed to have a mother tending to her—arranging their hair, straightening and re-tying bows and sashes, whispering in their ears.  The girls were ignoring their mothers, their eyes intent on the paper in their hands, their lips moving.\n I stood in the midst of this, in my wrinkled sleeveless cotton blouse, my faded madras shorts, my dark blue Keds, my street-car blown hair.  I looked around, wondering what to do next.  And then I saw him, standing next to a small table in a corner.   He was tall, as handsome as a movie star, with broad shoulders, long legs, and a thick mustache.  I went to him.\n“Are you the Director?” I asked, looking way up.\n“I am,” he said.  \nHe examined me closely from his great height, then glanced around him.\n“Where’s your mother?” he asked.\n“She dropped me off,” I said.\nHe shuffled through a stack of papers on a small table, and handed one to me.\n“This is what you’ll read,” he said.  “Write your name on this list.”\nI climbed up the tier of chairs and sat down in the empty row at the very top. I pulled my legs to my chest and squinted at the paper.  I knew from the newspaper article that the auditions were for many women and for one little girl, between the ages of nine and fourteen.  I learned from the typed paper that I was there to audition for the role of Little Mary in a play called “The Women”, written in the 1930s, by Clare Boothe Luce.  I read the lines of a short scene between Little Mary and her mother.  Her mother tells her that she and her father are getting a divorce. Little Mary has questions and is unhappy and afraid.  When her mother leaves the stage, Little Mary stays behind and cries.\nI read the scene, and then I read it again.  At that time, when I was eleven years old and sitting at the top of the tier of theater seats, my legs pulled to my chest, I could not think of anyone I knew whose parents were divorced.  But as I read and re-read the scene, a memory came to me, the same one that kept me from sleeping on the nights that my father told my mother that he would be working late and I was sent to bed too early, to toss and turn in the dark while my sheets tangled and my pillow grew hot.\nWhat I remembered was the night when my parents returned home from a party, and my mother quickly grabbed up the car keys from the hall table and left to take the babysitter home after my father had gone upstairs to his room. When I passed him on the stairs on my way up and his way down again, he had removed his coat and tie and unbuttoned his collar.\n“Momma’s gone to take Sarah home,” I told him.\nHe did not respond.  I continued up the stairs, but almost at the top I heard a strange sound, the bursting, guttural kind of sound that someone makes in anger.   Before then, I had never heard my father’s anger.  His anger came differently, transforming his face into a stone mask of distance and disdain.  Frightened, I nevertheless tiptoed back down the stairs and stood in the small hallway, peering into the dining room.  My father, his back to me, picked up a dining chair and threw it across the room, where it hit the wall so hard it bounced away and landed on its side in the living room.  I gasped.  I saw him grow very still, then slowly turn around. I took a step backwards into the shadowy hall.  We could not see each other.\n“Go to bed, Lisa,” he said from the dining room, his voice impassive.\nI went to bed.   I cried hot tears, rigid with shame. I could no longer hide from what it now seemed that I had always known--my father wanted to be away from us. It did not matter to me then, at eight or nine years old, where he wanted to go, only that he could not bear being there with us.  And I understood that my mother knew this, too, and had locked him inside the cage of home and family she had created just for him, this time by taking the keys and driving the babysitter home.</p><p>The Director called my name.\nI went down the stairs and saw that there were not many people left in the theater.  I walked onto the stage, suddenly blinded by spotlights strapped to beams above me.  I could barely see the Director, who was sitting in the shadows beyond the lights.  A dark-haired woman came onto the stage and smiled at me.  She read a line.  I realized that she was playing my mother’s role.  As she and I read the dialogue back and forth, hearing the language come alive, I remember thinking that Claire Booth Luce was a very good writer.  And then, I wasn’t thinking about anything outside of Little Mary’s world.  Standing there, I felt it all—the child’s fear that her father was leaving, her mother’s pain, the not knowingness of what would happen to her.  The world seemed very big and frightening to Little Mary.  There was an emptiness at its center.  I tried to pour everything she felt, everything it then seemed to me that I had always felt, into those words.\nWhen her mother left the stage, Little Mary stayed behind.  I gripped the back of a ladder-back chair on the stage.  I felt sorrow and shame.  I begged my parents, who were not there to hear me, with the words from the script.\n “Please, Daddy darling,” I cried.  “Mother dearest, please.”\nAnd then it was over.  I looked towards the Director.  I couldn’t see his expression, but I could tell he was looking at me, his head cocked to the side.  Someone sitting next to him leaned over and whispered in his ear.  The Director didn’t respond.\n“Thank you,” he said to me finally.\nI made my way back through the Quarter and to Canal Street.  I waited a long time for a streetcar.  I gave the conductor my dime and went home.  </p><p></p><p></p>"}}}],"pageHeading":"Excerpt From My Book"}},"pageContext":{}}